Tekla Open API Reference for Tekla Structures 2025
SpiralBeam.RotationAxisUpPoint Property
 Gets or sets the second definition point of the spiral beam rotation axis.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point RotationAxisUpPoint { get; set; }
Public Property RotationAxisUpPoint As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
SpiralBeam Class
Tekla.Structures.Model Namespace